# Btu Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Btu Property
SymbolTypeId Class See Also
---
Symbol Btu, indicating unit British thermal units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Btu { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Btu As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Btu {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace